In [1]:
import pandas as pd
import pymongo
import psycopg2
from sqlalchemy import create_engine
from sqlalchemy import text
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
# conn = psycopg2.connect(database="postgres", user='postgres', password='Shjais2014', host='127.0.0.1', port='5432')
# conn.autocommit = True

In [3]:
csv_file = "./Data/breweries.csv"
breweries_df = pd.read_csv(csv_file)
breweries_df.head()

   Unnamed: 0                       name           city state
0           0         NorthGate Brewing     Minneapolis    MN
1           1  Against the Grain Brewery     Louisville    KY
2           2   Jack's Abby Craft Lagers     Framingham    MA
3           3  Mike Hess Brewing Company      San Diego    CA
4           4    Fort Point Beer Company  San Francisco    CA

In [4]:
breweries_df = breweries_df.drop(columns=['Unnamed: 0', 'city']) 
breweries_df

                              name state
0               NorthGate Brewing     MN
1        Against the Grain Brewery    KY
2         Jack's Abby Craft Lagers    MA
3        Mike Hess Brewing Company    CA
4          Fort Point Beer Company    CA
..                             ...   ...
553            Covington Brewhouse    LA
554                Dave's Brewfarm    WI
555          Ukiah Brewing Company    CA
556        Butternuts Beer and Ale    NY
557  Sleeping Lady Brewing Company    AK

[558 rows x 2 columns]

In [5]:
breweries_df = breweries_df.groupby(['state']).count()
breweries_df

       name
state
 AK       7
 AL       3
 AR       2
 AZ      11
 CA      39
 CO      47
 CT       8
 DC       1
 DE       2
 FL      15
 GA       7
 HI       4
 IA       5
 ID       5
 IL      18
 IN      22
 KS       3
 KY       4
 LA       5
 MA      23
 MD       7
 ME       9
 MI      32
 MN      12
 MO       9
 MS       2
 MT       9
 NC      19
 ND       1
 NE       5
 NH       3
 NJ       3
 NM       4
 NV       2
 NY      16
 OH      15
 OK       6
 OR      29
 PA      25
 RI       5
 SC       4
 SD       1
 TN       3
 TX      28
 UT       4
 VA      16
 VT      10
 WA      23
 WI      20
 WV       1
 WY       4

In [6]:
breweries_df.head()

       name
state
 AK       7
 AL       3
 AR       2
 AZ      11
 CA      39

In [7]:
csv_file = "./Data/Costs of Excessive Alcohol Consumption by State.csv"
costs_df = pd.read_csv(csv_file)
costs_df.head()

  State    Location  Total Cost ($)  Cost per drink ($) Cost per capita ($)
0    AL     Alabama   3,724,300,000                2.27                 779
1    AK      Alaska     827,200,000                2.25               1,165
2    AZ     Arizona   5,946,400,000                2.27                 930
3    AR    Arkansas   2,073,300,000                2.27                 711
4    CA  California  35,010,600,000                2.44                 940

In [8]:
costs_df = costs_df.drop(columns=['Location']) 
costs_df.head()

  State  Total Cost ($)  Cost per drink ($) Cost per capita ($)
0    AL   3,724,300,000                2.27                 779
1    AK     827,200,000                2.25               1,165
2    AZ   5,946,400,000                2.27                 930
3    AR   2,073,300,000                2.27                 711
4    CA  35,010,600,000                2.44                 940

In [9]:
costs_df.rename(columns = {'State':'state', 'Total Cost ($)':'total_cost', 'Cost per drink ($)':'cost_per_drink',
                          'Cost per capita ($)':'cost_per_capita'}, inplace = True) 
costs_df.head()

  state      total_cost  cost_per_drink cost_per_capita
0    AL   3,724,300,000            2.27             779
1    AK     827,200,000            2.25           1,165
2    AZ   5,946,400,000            2.27             930
3    AR   2,073,300,000            2.27             711
4    CA  35,010,600,000            2.44             940

In [10]:
costs_df = costs_df.set_index("state")
costs_df.head()

           total_cost  cost_per_drink cost_per_capita
state
AL      3,724,300,000            2.27             779
AK        827,200,000            2.25           1,165
AZ      5,946,400,000            2.27             930
AR      2,073,300,000            2.27             711
CA     35,010,600,000            2.44             940

In [11]:
costs_df['total_cost'] = costs_df['total_cost'].str.replace(',', '')
costs_df['cost_per_capita'] = costs_df['cost_per_capita'].str.replace(',', '')
costs_df.head()

        total_cost  cost_per_drink cost_per_capita
state
AL      3724300000            2.27             779
AK       827200000            2.25            1165
AZ      5946400000            2.27             930
AR      2073300000            2.27             711
CA     35010600000            2.44             940

In [12]:
csv_file = "./Data/Intensity of Binge Drinking.csv"
intensity_df = pd.read_csv(csv_file)
intensity_df.head()

  State  Percentage
0    AL         7.3
1    AK         7.8
2    AZ         7.1
3    AR         8.3
4    CA         6.5

In [13]:
# rename columns in intensity_df, the website, https://www.cdc.gov/alcohol/data-stats.htm, says this is not a percentage but
# the average largest number of drinks consumed by binge drinkers on any occasion
intensity_df.rename(columns = {'State':'state', 'Percentage':'average_num_of_drinks'}, inplace = True) 
intensity_df.head()

  state  average_num_of_drinks
0    AL                    7.3
1    AK                    7.8
2    AZ                    7.1
3    AR                    8.3
4    CA                    6.5

In [14]:
intensity_df = intensity_df.set_index("state")
intensity_df.head()

       average_num_of_drinks
state
AL                       7.3
AK                       7.8
AZ                       7.1
AR                       8.3
CA                       6.5

In [15]:
csv_file = "./Data/Prevalence of Binge Drinking.csv"
prevalence_df = pd.read_csv(csv_file)
prevalence_df.head()

  State  Percentage
0    AL        12.2
1    AK        20.0
2    AZ        15.0
3    AR        15.2
4    CA        16.7

In [16]:
prevalence_df.rename(columns = {'State':'state', 'Percentage':'percentage'}, inplace = True) 
prevalence_df.head()

  state  percentage
0    AL        12.2
1    AK        20.0
2    AZ        15.0
3    AR        15.2
4    CA        16.7

In [17]:
prevalence_df = prevalence_df.set_index("state")
prevalence_df.head()

       percentage
state
AL           12.2
AK           20.0
AZ           15.0
AR           15.2
CA           16.7

In [18]:
conn = psycopg2.connect(database="Breweries", user='postgres', password='Calimg123', host='127.0.0.1', port='5432')
conn.autocommit = True
cursor = conn.cursor()

In [19]:
schema_sql = open('sql/schema.sql','r')
cursor.execute(schema_sql.read())
print("Database Schema Loaded Successfully (Tables Created)........")

Database Schema Loaded Successfully (Tables Created)........

In [20]:
schema_sql.close()

In [21]:
#database connection
connection_string ="postgres:Calimg123@localhost:5432/Breweries"
engine = create_engine(f'postgresql://{connection_string}')

In [22]:
#confirm tables
engine.table_names()

['breweries', 'costs', 'intensity', 'prevalence']

In [23]:
### Load DataFrames into database
breweries_df.to_sql(name='breweries', con=engine, if_exists='append', index = True)

In [24]:
costs_df.to_sql(name='costs', con=engine, if_exists='append', index = True)

In [25]:
intensity_df.to_sql(name='intensity', con=engine, if_exists='append', index=True)

In [26]:
prevalence_df.to_sql(name='prevalence', con=engine, if_exists='append', index = True)

In [27]:
breweries_df.reset_index(inplace=True)
costs_df.reset_index(inplace=True)
intensity_df.reset_index(inplace=True)
prevalence_df.reset_index(inplace=True)

In [28]:
breweries_df['state'].value_counts().sort_index()

 AK    1
 AL    1
 AR    1
 AZ    1
 CA    1
 CO    1
 CT    1
 DC    1
 DE    1
 FL    1
 GA    1
 HI    1
 IA    1
 ID    1
 IL    1
 IN    1
 KS    1
 KY    1
 LA    1
 MA    1
 MD    1
 ME    1
 MI    1
 MN    1
 MO    1
 MS    1
 MT    1
 NC    1
 ND    1
 NE    1
 NH    1
 NJ    1
 NM    1
 NV    1
 NY    1
 OH    1
 OK    1
 OR    1
 PA    1
 RI    1
 SC    1
 SD    1
 TN    1
 TX    1
 UT    1
 VA    1
 VT    1
 WA    1
 WI    1
 WV    1
 WY    1
Name: state, dtype: int64

In [29]:
merged = costs_df.merge(intensity_df,on='state').merge(prevalence_df,on='state')

In [30]:
merged

,state,total_cost,cost_per_drink,cost_per_capita,average_num_of_drinks,percentage
0,AL,3724300000,2.27,779,7.3,12.2
1,AK,827200000,2.25,1165,7.8,20.0
2,AZ,5946400000,2.27,930,7.1,15.0
3,AR,2073300000,2.27,711,8.3,15.2
4,CA,35010600000,2.44,940,6.5,16.7
5,CO,5056500000,2.14,1005,6.6,18.1
6,CT,3029000000,2.04,847,7.0,18.3
7,DE,803800000,1.64,895,7.0,15.8
8,District of Columbia,918400000,2.14,1526,6.2,24.4
9,FL,15322200000,1.82,815,6.8,17.2
10,GA,6930900000,2.12,715,6.9,15.8
11,HI,937400000,1.58,689,7.6,19.8
12,ID,1137900000,1.62,726,7.4,14.8
13,IL,9715700000,1.86,757,7.1,20.8
14,IN,4468200000,1.96,689,7.2,16.6
15,IA,1933600000,1.59,635,7.6,21.3
16,KS,2075800000,2.18,728,7.0,16.5
17,KY,3194500000,2.36,736,7.8,16.1
18,LA,3801400000,1.91,839,7.6,18.0
19,ME,938700000,1.58,707,7.4,20.2
20,MD,4964700000,2.22,860,6.6,14.7
21,MA,5634600000,1.93,861,6.5,18.7
22,MI,8161700000,2.10,826,7.3,19.8
23,MN,3886400000,1.74,733,7.2,20.5
24,MS,2277400000,2.05,768,7.6,12.5
25,MO,4603600000,1.83,769,7.8,17.7
26,MT,870800000,1.73,880,7.2,21.3
27,NE,1166500000,1.61,639,7.2,20.4
28,NV,2296300000,1.49,850,7.2,14.5
29,NH,959900000,0.92,729,6.4,17.8
30,NJ,6175200000,1.70,702,6.9,17.0
31,NM,2232900000,2.77,1084,7.2,13.6
32,NY,16330200000,2.28,843,6.8,17.6
33,NC,7034200000,2.11,738,6.4,14.6
34,ND,487600000,1.40,725,7.7,24.9
35,OH,8519800000,2.10,739,7.7,19.5
36,OK,3081200000,2.49,821,7.5,13.6
37,OR,3520200000,2.08,919,6.3,17.7
38,PA,9544200000,1.92,751,7.0,18.5
39,RI,886500000,1.82,842,7.0,17.0
40,SC,3982900000,2.13,861,7.4,16.3
41,SD,598200000,1.59,735,7.7,17.9
42,TN,4683800000,2.25,738,7.0,10.9
43,TX,18820600000,1.99,748,7.2,16.1
44,UT,1636100000,2.74,592,7.3,11.4
45,VT,513000000,1.66,820,6.8,19.0
46,VA,6126000000,2.06,766,7.1,17.0
47,WA,5805100000,2.23,863,6.2,16.6
48,WV,1334900000,2.20,720,7.9,11.8
49,WI,4452900000,1.62,783,7.2,24.4
50,WY,593100000,2.33,1052,7.0,16.9

In [49]:
merged.state[8] = 'DC'

<ipython-input-49-6b838819ad9c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  merged.state[8] = 'DC'

In [54]:
breweries_df.state

0      AK
1      AL
2      AR
3      AZ
4      CA
5      CO
6      CT
7      DC
8      DE
9      FL
10     GA
11     HI
12     IA
13     ID
14     IL
15     IN
16     KS
17     KY
18     LA
19     MA
20     MD
21     ME
22     MI
23     MN
24     MO
25     MS
26     MT
27     NC
28     ND
29     NE
30     NH
31     NJ
32     NM
33     NV
34     NY
35     OH
36     OK
37     OR
38     PA
39     RI
40     SC
41     SD
42     TN
43     TX
44     UT
45     VA
46     VT
47     WA
48     WI
49     WV
50     WY
Name: state, dtype: object

In [55]:
merged.to_csv('merged_WO_breweries.csv')